/**
 * 一次考试共考了语文、代数和外语 3 科。某小组共有 9 人，考后各科及格名单如下，请编写算法找出 3 科全及格的学生名单（学号）
 * ----------------------------------------------------
 *      科目               及格学生学号
 * ----------------------------------------------------
 *      语文               1,9,6,8,4,3,7
 *      代数               5,2,9,1,3,7
 *      外语               8,1,6,7,3,5,4,9 
 * ----------------------------------------------------
 */


#include<iostream>

using namespace std;

int main() {
    int a[10] = {0};
    int ID;
    for (int i = 1; i <=21; i++) {
        cin >> ID;
        a[ID]++;
    }   

    for (int i = 1; i <= end(a) - begin(a) - 1; i++) {
        if (a[i] == 3) {
            cout << i << " ";
        }
    }

    return 0;
}

