/**
 * 三位老师对某次数学竞赛进行了预测。他们的预测如下。
 * 甲：学生 A 得第一名，学生 B 得第三名
 * 乙：学生 C 得第一名，学生 D 得第四名
 * 丙：学生 D 得第二名，学生 A 得第三名
 */
/*问题分析：
 *      用数 1,2,3,4 分别代表学生 a,b,c,d 获得的名次，试编程输出 a,b,c,d 就可以利用三重循环来解决了
 */
#include <iostream>
using namespace std;

int main() {
    for (int a = 1; a <= 4; a++)
        for (int b = 1; b <= 4; b++)
            if (a != b) 
                for (int c = 1; c <= 4; c++)
                    if (a != c && b != c) {
                        // 因为 1 + 2 + 3 + 4 = 10，总名次之和为 10
                        int d = 10 - a - b - c;
                        // 这里代表老师说说的话
                        if ( (a == 1) + (b == 3) == 1 && (c == 1) + (d == 4) == 1 && (d == 2) + (a == 3) == 1) 
                            printf("a, b, c, d = %d, %d, %d, %d", a, b, c, d);
                    }

    return 0;
}